recent commit has addressed issues that were brought in the description of this PR, we now get successful applies:
```hcl
󰀵 mau  …/Scratch/ephemeral-write-only/secret_version   22:37   envchain GCLOUD terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # google_secret_manager_secret.secret-basic will be created
  + resource "google_secret_manager_secret" "secret-basic" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
          + "label"                      = "my-label"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "label" = "my-label"
        }
      + name                  = (known after apply)
      + project               = "hc-terraform-testing"
      + secret_id             = "secret-version"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
          + "label"                      = "my-label"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret_version.secret-version-basic will be created
  + resource "google_secret_manager_secret_version" "secret-version-basic" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data_wo        = (write-only attribute)
      + version               = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_secret_manager_secret.secret-basic: Creating...
google_secret_manager_secret.secret-basic: Creation complete after 1s [id=projects/hc-terraform-testing/secrets/secret-version]
google_secret_manager_secret_version.secret-version-basic: Creating...
google_secret_manager_secret_version.secret-version-basic: Creation complete after 1s [id=projects/871647908372/secrets/secret-version/versions/1]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

󰀵 mau  …/Scratch/ephemeral-write-only/secret_version   22:37   envchain GCLOUD terraform apply
google_secret_manager_secret.secret-basic: Refreshing state... [id=projects/hc-terraform-testing/secrets/secret-version]
google_secret_manager_secret_version.secret-version-basic: Refreshing state... [id=projects/871647908372/secrets/secret-version/versions/1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```

still unable to move to review due to a dependency being set as `"github.com/zclconf/go-cty/cty"` upon generation instead of `"github.com/hashicorp/go-cty/cty"`

This will be addressed in a commit pushed on upstream `FEATURE-BRANCH-ephemeral-write-only`
